Revit 2026 API

# RailingGetSubelementOnLevel Method

---

Gets the subelement on given level.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Subelement GetSubelementOnLevel(
	ElementId levelId
)
```
```vb
Public Function GetSubelementOnLevel (
	levelId As ElementId
) As Subelement
```
```cpp
public:
Subelement^ GetSubelementOnLevel(
	ElementId^ levelId
)
```
```fsharp
member GetSubelementOnLevel :
        levelId : ElementId -> Subelement
```

#### Parameters

levelId ElementId
     The id of the level the railing subelement is placed on.

#### Return Value

Subelement The subelement in given level.  will be returned if railing has no subelements on given level.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The railing is not hosted by stairs in MultistoryStairs. |

The method is valid only for railings hosted by stairs in MultistoryStairs. Input level should be a level of the railing stairs. See getStairsPlacementLevels method of MultistoryStairs.

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace